Конфигурация/src/Documents/НоминальныйОбъем/НоминальныйОбъем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НоминальныйОбъем</name>
  <posting>Deny</posting>
  <attributes>
    <name>АктДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>EnumRef.ВидКонтрля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспытаний</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтбора</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднееАрефметическоеОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднееКвадратическоеОтклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднееСодержимоеПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНПА</name>
    <type>
      <types>CatalogRef.ТНПА</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНПА2</name>
    <type>
      <types>CatalogRef.ТНПА</types>
    </type>
  </attributes>
  <attributes>
    <name>Брак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УсловияИспытаний</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеУсловие</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечноеУсловие</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмерительныеПриборы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоверки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующейПоверки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоминальныйОбъем</name>
    <attributes>
      <name>МассаБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПустойУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПродукта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействительныйОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрограммаИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/Поверки/Поверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Поверки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПоверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСледующейПоверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Catalogs/НаборыОборудования/НаборыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Прибор</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Catalogs/ПланыКонтроля/ПланыКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыКонтроля</name>
  <attributes>
    <name>ИмяТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемочноеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БраковочноеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Documents/НоминальныйОбъем/Forms/ФормаДокумента/Module.bsl
// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// При создании на сервере заполняет таблицу условий испытания
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	УсловияИспытаний.Наименование,
			|	УсловияИспытаний.Ссылка
			|ИЗ
			|	Справочник.УсловияИспытаний КАК УсловияИспытаний
			|ГДЕ
			|	УсловияИспытаний.Предопределенный = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТаблицУсловия = Объект.Условия.Добавить();
			СтрокаТаблицУсловия.Показатель = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмерительныеПриборы

// Измерительные приборы наименование обработка выбора.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ВыбранноеЗначение - СправочникСсылка.Оборудование - Выбранное значение
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаКлиенте
Процедура ИзмерительныеПриборыНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.ИзмерительныеПриборы.ТекущиеДанные;
	Если Не ТребуетсяПоверка(ВыбранноеЗначение) Тогда
		ПараДат = ИзмерительныеПриборыПриИзмененииНаСервере(Объект.Дата, ВыбранноеЗначение.Ссылка);
		ДанныеСтроки.ДатаПоверки = ПараДат.ДатаПоверки;
		ДанныеСтроки.ДатаСледующейПоверки = ПараДат.ДатаСледующейПоверки;
	Иначе
		ДанныеСтроки.ДатаПоверки = Неопределено;
		ДанныеСтроки.ДатаСледующейПоверки = Неопределено;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыНоминальныйОбъем
&НаКлиенте
Процедура НоминальныйОбъемМассаБруттоПриИзменении(Элемент)
	Пересчет(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НоминальныйОбъемМассаПустойУпаковкиПриИзменении(Элемент)
	Пересчет(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НоминальныйОбъемМассаПродуктаПриИзменении(Элемент)
	Пересчет(Элемент);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСписокОборудования(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтотОбъект, "ПодборОборудования");
	ОткрытьФорму("Справочник.НаборыОборудования.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОбработкаВыбора);	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Получить коэффициент для расчета доверительного интервала.
// 
// Параметры:
//  РазмерПартии - Число - Объем выборки
//  ИмяТаблицы - Строка - Имя таблицы в справочнике Планы контроля
// 
// Возвращаемое значение:
//  Число
//
&НаСервере  
Функция ПолучитьКоэффициент(РазмерПартии, ИмяТаблицы)
	Перем Коэффициент; //Число
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланыКонтроля.Коэффициент
		|ИЗ
		|	Справочник.ПланыКонтроля КАК ПланыКонтроля
		|ГДЕ
		|	ПланыКонтроля.ИмяТаблицы = &ИмяТаблицы
		|	И ПланыКонтроля.ПометкаУдаления = ЛОЖЬ
		|	И ПланыКонтроля.МинимальныйОбъем <= &РазмерПартии
		|	И ПланыКонтроля.МаксимальныйОбъем >= &РазмерПартии";
	
	Запрос.УстановитьПараметр("РазмерПартии", РазмерПартии);
	Запрос.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Коэффициент = ВыборкаДетальныеЗаписи.Коэффициент;
	КонецЦикла;
	Если Коэффициент = Неопределено Тогда
		Коэффициент = 0;
	КонецЕсли;
	Возврат Коэффициент;
КонецФункции

// Получить плотность.
// 
// Параметры:
//  СсылкаНоменклатура - СправочникСсылка.Номенклатура
// 
// Возвращаемое значение:
//  Число
&НаСервере
Функция ПолучитьПлотность(СсылкаНоменклатура)
	Номенклатура =СсылкаНоменклатура.ПолучитьОбъект();
	Возврат Номенклатура.Плотность;
КонецФункции

// Пересчет.
// 
// Параметры:
//  Элемент - ПолеФормы
&НаКлиенте
Процедура Пересчет(Элемент)
	ДанныеСтроки = Элементы.НоминальныйОбъем.ТекущиеДанные;
	Если Элемент.Имя = "НоминальныйОбъемМассаБрутто" или Элемент.Имя = "НоминальныйОбъемМассаПустойУпаковки" Тогда
		ДанныеСтроки.МассаПродукта = ДанныеСтроки.МассаБрутто - ДанныеСтроки.МассаПустойУпаковки;
	ИначеЕсли Элемент.Имя = "НоминальныйОбъемМассаПродукта" Тогда
		 ДанныеСтроки.МассаПустойУпаковки = ДанныеСтроки.МассаБрутто - ДанныеСтроки.МассаПустойУпаковки;
	КонецЕсли;
	ДанныеСтроки.ДействительныйОбъем = ДанныеСтроки.МассаПродукта/ПолучитьПлотность(Объект.Номенклатура);
	Объект.СреднееАрефметическоеОбъема = Объект.НоминальныйОбъем.Итог("ДействительныйОбъем")/Объект.НоминальныйОбъем.Количество();

    СуммаОтклонений = 0;
    ТаблицаДанных = Объект.НоминальныйОбъем;
    КоличествоИзмерений = ТаблицаДанных.Количество();
    Для Каждого СтрокаТД Из ТаблицаДанных Цикл
        СуммаОтклонений = СуммаОтклонений + ((Объект.СреднееАрефметическоеОбъема - СтрокаТД.ДействительныйОбъем)*(Объект.СреднееАрефметическоеОбъема - СтрокаТД.ДействительныйОбъем));
    КонецЦикла;
    Объект.СреднееКвадратическоеОтклонение = sqrt(1/(КоличествоИзмерений-1)*СуммаОтклонений);
    Объект.СреднееСодержимоеПартии = Объект.СреднееАрефметическоеОбъема + (ПолучитьКоэффициент(Объект.РазмерПартии, "Б2") * Объект.СреднееКвадратическоеОтклонение);
КонецПроцедуры

// При закрытии формы выбора набора оборудования.
// 
// Параметры:
//  Значение - СправочникСсылка.НаборыОборудования
//  ДопПараметры - Структура
&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

	Если Значение <> Неопределено Тогда
		Объект.ИзмерительныеПриборы.Очистить();
		СписокОборудования = Новый Массив();
		СписокОборудования = ЗаполнитьСписокОборудованияНаСервере(Значение, Объект.Дата); 
		Для Каждого ЕденицаОбрудования Из СписокОборудования Цикл
			НоваяСтрока = Объект.ИзмерительныеПриборы.Добавить();
			НоваяСтрока.Наименование = ЕденицаОбрудования.СсылкаПрибор;
			НоваяСтрока.ДатаПоверки = ЕденицаОбрудования.ДатаПоверки;
			НоваяСтрока.ДатаСледующейПоверки = ЕденицаОбрудования.ДатаСледующейПоверки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Функция проверяет требуется ли поверка оборудования
// 
// Параметры:
//  Оборудование - СправочникСсылка.Оборудование, Произвольный - Оборудование
// 
// Возвращаемое значение:
//  Булево - Истина если поверка не требуется
&НаСервере
Функция ТребуетсяПоверка(Оборудование)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оборудование.ПоверкаНеТребуется КАК ПоверкаНеТребуется
	|ИЗ
	|	Справочник.Оборудование КАК Оборудование
	|ГДЕ
	|	Оборудование.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Оборудование);

	РезультатЗапроса = Запрос.Выполнить();
	 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ПоверкаНеТребуется;
	КонецЦикла;

КонецФункции


// Функция возвращает дату последней и следующей поверки оборудования
// 
// Параметры:
//  ДатаСреза - Дата
//  Оборудование - СправочникСсылка.Оборудование
// 
// Возвращаемое значение:
//  Структура:
// 		* ДатаПоверки - Дата
// 		* ДатаСледующейПоверки - Дата
&НаСервере
Функция ИзмерительныеПриборыПриИзмененииНаСервере(ДатаСреза, Оборудование)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоверкиСрезПоследних.ДатаПоверки,
	|	ПоверкиСрезПоследних.ДатаСледующейПоверки
	|ИЗ
	|	РегистрСведений.Поверки.СрезПоследних(&ДатаСреза,) КАК ПоверкиСрезПоследних
	|ГДЕ
	|	ПоверкиСрезПоследних.Оборудование = &Оборудование";

	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Даты = Новый Структура;
		Даты.Вставить("ДатаПоверки", ВыборкаДетальныеЗаписи.ДатаПоверки);
		Даты.Вставить("ДатаСледующейПоверки", ВыборкаДетальныеЗаписи.ДатаСледующейПоверки);
		Возврат Даты;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Заполнить список оборудования на сервере.
// 
// Параметры:
//  ВыбранныйНабор - СправочникСсылка.НаборыОборудования - Набор оборудования выбранный для иссследования
//  ДатаСреза - Дата
// 
// Возвращаемое значение:
//  Структура:
//   * СсылкаПрибор - СправочникСсылка.Оборудование
//   * ДатаПоверки - Дата
//   * ДатаСледующейПоверки - Дата
//   
&НаСервере
Функция ЗаполнитьСписокОборудованияНаСервере(ВыбранныйНабор, ДатаСреза)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НаборыОборудованияОборудование.Прибор.Ссылка КАК СсылкаПрибор,
		|	ПоверкиСрезПоследних.ДатаПоверки КАК ДатаПоверки,
		|	ПоверкиСрезПоследних.ДатаСледующейПоверки КАК ДатаСледующейПоверки
		|ИЗ
		|	Справочник.НаборыОборудования.Оборудование КАК НаборыОборудованияОборудование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Поверки.СрезПоследних(&ДатаСреза,) КАК ПоверкиСрезПоследних
		|		ПО НаборыОборудованияОборудование.Прибор.Ссылка = ПоверкиСрезПоследних.Оборудование.Ссылка
		|ГДЕ
		|	НаборыОборудованияОборудование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйНабор);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);	
	
	ТЗОборудования = Новый ТаблицаЗначений();
	ТЗОборудования = Запрос.Выполнить().Выгрузить();
	МассивОборудования = ОбщегоНазначенияВызовСервера.ПреобразоватьТаблицуЗначенийВМассив(ТЗОборудования);
	Возврат МассивОборудования;
КонецФункции
#КонецОбласти
